In [1]:
import numpy as np
import pandas as pd

## Creating DataFrames

In [2]:
df = pd.DataFrame(np.random.randn(5, 4), index=['A', 'B', 'C', 'D', 'E'],
            columns=['W', 'X', 'Y', 'Z'])

In [3]:
df

          W         X         Y         Z
A -0.424315  1.540065 -0.620198  0.362044
B -1.292596  0.762969  1.006669 -0.490330
C -1.519233 -0.668589  0.501559  0.059415
D  1.786433 -0.154325  1.027536  1.105493
E -0.283684  0.129160  1.373828  0.520766

In [4]:
df['W']

A   -0.424315
B   -1.292596
C   -1.519233
D    1.786433
E   -0.283684
Name: W, dtype: float64

In [5]:
df['Z']

A    0.362044
B   -0.490330
C    0.059415
D    1.105493
E    0.520766
Name: Z, dtype: float64

In [6]:
df[['X', 'Y']]

          X         Y
A  1.540065 -0.620198
B  0.762969  1.006669
C -0.668589  0.501559
D -0.154325  1.027536
E  0.129160  1.373828

In [7]:
df['New Column'] = df['W'] + df['Y']

In [8]:
df

          W         X         Y         Z  New Column
A -0.424315  1.540065 -0.620198  0.362044   -1.044513
B -1.292596  0.762969  1.006669 -0.490330   -0.285927
C -1.519233 -0.668589  0.501559  0.059415   -1.017674
D  1.786433 -0.154325  1.027536  1.105493    2.813970
E -0.283684  0.129160  1.373828  0.520766    1.090144

In [9]:
df['New Column'] = [0, 1, 2, 3, 4]

In [10]:
df

          W         X         Y         Z  New Column
A -0.424315  1.540065 -0.620198  0.362044           0
B -1.292596  0.762969  1.006669 -0.490330           1
C -1.519233 -0.668589  0.501559  0.059415           2
D  1.786433 -0.154325  1.027536  1.105493           3
E -0.283684  0.129160  1.373828  0.520766           4

In [11]:
df.drop('New Column', axis=1)

          W         X         Y         Z
A -0.424315  1.540065 -0.620198  0.362044
B -1.292596  0.762969  1.006669 -0.490330
C -1.519233 -0.668589  0.501559  0.059415
D  1.786433 -0.154325  1.027536  1.105493
E -0.283684  0.129160  1.373828  0.520766

In [12]:
df.shape

(5, 5)

In [13]:
df

          W         X         Y         Z  New Column
A -0.424315  1.540065 -0.620198  0.362044           0
B -1.292596  0.762969  1.006669 -0.490330           1
C -1.519233 -0.668589  0.501559  0.059415           2
D  1.786433 -0.154325  1.027536  1.105493           3
E -0.283684  0.129160  1.373828  0.520766           4

In [14]:
df.drop('New Column', axis=1, inplace=True)

In [15]:
df

          W         X         Y         Z
A -0.424315  1.540065 -0.620198  0.362044
B -1.292596  0.762969  1.006669 -0.490330
C -1.519233 -0.668589  0.501559  0.059415
D  1.786433 -0.154325  1.027536  1.105493
E -0.283684  0.129160  1.373828  0.520766

In [16]:
df.loc['A']

W   -0.424315
X    1.540065
Y   -0.620198
Z    0.362044
Name: A, dtype: float64

In [17]:
df.iloc[1]

W   -1.292596
X    0.762969
Y    1.006669
Z   -0.490330
Name: B, dtype: float64

In [18]:
df['W']

A   -0.424315
B   -1.292596
C   -1.519233
D    1.786433
E   -0.283684
Name: W, dtype: float64

In [19]:
df.loc[ ['A', 'B'], ['W', 'Y']]

          W         Y
A -0.424315 -0.620198
B -1.292596  1.006669

In [20]:
pd.DataFrame(np.random.randn(5, 4))

          0         1         2         3
0  0.211099  1.261958 -0.856375  0.199379
1 -0.148092  1.352586  0.384358 -0.216263
2 -0.595805 -1.198294 -1.602609  0.631796
3  1.674427 -0.979443  0.803331 -1.759430
4 -1.392108 -0.099773  0.375810  1.200693

In [21]:
myDict = {'X':[1, 2, 3], 'Y':[10, 20, 30], 'Z':[100, 200, 300]}

In [22]:
pd.DataFrame(myDict)

   X   Y    Z
0  1  10  100
1  2  20  200
2  3  30  300

In [23]:
myDict = {'X':[1], 'Y':[2], 'Z':[3]}

In [24]:
pd.DataFrame(myDict)

   X  Y  Z
0  1  2  3

## Conditional Selection

In [25]:
df

          W         X         Y         Z
A -0.424315  1.540065 -0.620198  0.362044
B -1.292596  0.762969  1.006669 -0.490330
C -1.519233 -0.668589  0.501559  0.059415
D  1.786433 -0.154325  1.027536  1.105493
E -0.283684  0.129160  1.373828  0.520766

In [26]:
df['W']

A   -0.424315
B   -1.292596
C   -1.519233
D    1.786433
E   -0.283684
Name: W, dtype: float64

In [27]:
df['W'] > 0

A    False
B    False
C    False
D     True
E    False
Name: W, dtype: bool

In [28]:
df[df['W'] > 0]

          W         X         Y         Z
D  1.786433 -0.154325  1.027536  1.105493

In [29]:
df[df['W'] > 0]['X']

D   -0.154325
Name: X, dtype: float64

In [30]:
df[df['W'] > 0][['X', 'Y']]

          X         Y
D -0.154325  1.027536

In [31]:
df['Y']

A   -0.620198
B    1.006669
C    0.501559
D    1.027536
E    1.373828
Name: Y, dtype: float64

In [32]:
(df['Y'] > 0) & (df['Y']%2==0)

A    False
B    False
C    False
D    False
E    False
Name: Y, dtype: bool

In [33]:
df[(df['Y'] > 0) & (df['Y']%2==0)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [34]:
df

          W         X         Y         Z
A -0.424315  1.540065 -0.620198  0.362044
B -1.292596  0.762969  1.006669 -0.490330
C -1.519233 -0.668589  0.501559  0.059415
D  1.786433 -0.154325  1.027536  1.105493
E -0.283684  0.129160  1.373828  0.520766

In [35]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.424315  1.540065 -0.620198  0.362044
1     B -1.292596  0.762969  1.006669 -0.490330
2     C -1.519233 -0.668589  0.501559  0.059415
3     D  1.786433 -0.154325  1.027536  1.105493
4     E -0.283684  0.129160  1.373828  0.520766

In [36]:
df.reset_index(inplace=True)

In [37]:
df

  index         W         X         Y         Z
0     A -0.424315  1.540065 -0.620198  0.362044
1     B -1.292596  0.762969  1.006669 -0.490330
2     C -1.519233 -0.668589  0.501559  0.059415
3     D  1.786433 -0.154325  1.027536  1.105493
4     E -0.283684  0.129160  1.373828  0.520766

In [38]:
df['index'] = "a b c d e".split()

In [39]:
df

  index         W         X         Y         Z
0     a -0.424315  1.540065 -0.620198  0.362044
1     b -1.292596  0.762969  1.006669 -0.490330
2     c -1.519233 -0.668589  0.501559  0.059415
3     d  1.786433 -0.154325  1.027536  1.105493
4     e -0.283684  0.129160  1.373828  0.520766

In [40]:
df.set_index('index')

              W         X         Y         Z
index
a     -0.424315  1.540065 -0.620198  0.362044
b     -1.292596  0.762969  1.006669 -0.490330
c     -1.519233 -0.668589  0.501559  0.059415
d      1.786433 -0.154325  1.027536  1.105493
e     -0.283684  0.129160  1.373828  0.520766

In [41]:
df.set_index('index', inplace=True)

In [42]:
df

              W         X         Y         Z
index
a     -0.424315  1.540065 -0.620198  0.362044
b     -1.292596  0.762969  1.006669 -0.490330
c     -1.519233 -0.668589  0.501559  0.059415
d      1.786433 -0.154325  1.027536  1.105493
e     -0.283684  0.129160  1.373828  0.520766

In [43]:
titanicDf = pd.read_csv('titanic_train.csv')
titanicDf

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## Missing Values

In [54]:
d = {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1, 2, 3], 'D':[np.nan, np.nan, np.nan]}
df = pd.DataFrame(d)

In [55]:
df

     A    B  C   D
0  1.0  5.0  1 NaN
1  2.0  NaN  2 NaN
2  NaN  NaN  3 NaN

In [47]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [48]:
df.isnull().sum()

A    1
B    2
C    0
dtype: int64

In [49]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [50]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [52]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [56]:
df

     A    B  C   D
0  1.0  5.0  1 NaN
1  2.0  NaN  2 NaN
2  NaN  NaN  3 NaN

In [57]:
df.dropna(axis=1, thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [58]:
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [59]:
df.fillna(value = "FILL VALUE")

            A           B  C           D
0         1.0         5.0  1  FILL VALUE
1         2.0  FILL VALUE  2  FILL VALUE
2  FILL VALUE  FILL VALUE  3  FILL VALUE

In [60]:
df.fillna(df.mean())

     A    B  C   D
0  1.0  5.0  1 NaN
1  2.0  5.0  2 NaN
2  1.5  5.0  3 NaN

In [61]:
df.fillna(df.mean(), inplace=True)

In [62]:
df

     A    B  C   D
0  1.0  5.0  1 NaN
1  2.0  5.0  2 NaN
2  1.5  5.0  3 NaN

In [65]:
df.dropna(axis=1, inplace=True)

In [66]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

## GroupBy

In [67]:
data = {'Company':['GOOGLE', 'GOOGLE', 'MICROSOFT', 'MICROSOFT', 'FB', 'FB'], 
       'Person':['Sam', 'Charlie', 'Amy', 'Jack', 'Vanessa', 'Troy'], 
       'Sales':[200, 120, 300, 250, 340, 140]}

df = pd.DataFrame(data)

In [68]:
df

     Company   Person  Sales
0     GOOGLE      Sam    200
1     GOOGLE  Charlie    120
2  MICROSOFT      Amy    300
3  MICROSOFT     Jack    250
4         FB  Vanessa    340
5         FB     Troy    140

In [71]:
groupDf = df.groupby('Company')

In [72]:
groupDf.mean()

           Sales
Company
FB           240
GOOGLE       160
MICROSOFT    275

In [73]:
df.mean()

Sales    225.0
dtype: float64

In [74]:
df.sum()

Company    GOOGLEGOOGLEMICROSOFTMICROSOFTFBFB
Person           SamCharlieAmyJackVanessaTroy
Sales                                    1350
dtype: object

In [77]:
FBDF = df[df['Company'] == 'FB']

In [79]:
GDF = df[df['Company'] == 'GOOGLE']

In [80]:
FBDF

  Company   Person  Sales
4      FB  Vanessa    340
5      FB     Troy    140

In [81]:
GDF

  Company   Person  Sales
0  GOOGLE      Sam    200
1  GOOGLE  Charlie    120

In [82]:
groupDf.min()

            Person  Sales
Company
FB            Troy    140
GOOGLE     Charlie    120
MICROSOFT      Amy    250

In [83]:
groupDf.max()

            Person  Sales
Company
FB         Vanessa    340
GOOGLE         Sam    200
MICROSOFT     Jack    300

In [85]:
df.describe()

            Sales
count    6.000000
mean   225.000000
std     87.578536
min    120.000000
25%    155.000000
50%    225.000000
75%    287.500000
max    340.000000

In [86]:
groupDf.describe()

          Sales
          count   mean         std    min    25%    50%    75%    max
Company
FB          2.0  240.0  141.421356  140.0  190.0  240.0  290.0  340.0
GOOGLE      2.0  160.0   56.568542  120.0  140.0  160.0  180.0  200.0
MICROSOFT   2.0  275.0   35.355339  250.0  262.5  275.0  287.5  300.0

In [87]:
groupDf.count()

           Person  Sales
Company
FB              2      2
GOOGLE          2      2
MICROSOFT       2      2

## Concatenation

In [97]:
df1 = pd.DataFrame({'A':['A0', 'A1', 'A2', 'A3'], 
                    'B':['B0', 'B1', 'B2', 'B3'], 
                    'C':['C0', 'C1', 'C2', 'C3'], 
                    'D':['D0', 'D1', 'D2', 'D3']},
                  index = [0, 1, 2, 3])

In [99]:
df2 = pd.DataFrame({'A':['A4', 'A5', 'A6', 'A7'], 
                    'B':['B4', 'B5', 'B6', 'B7'], 
                    'C':['C4', 'C5', 'C6', 'C7'], 
                    'D':['D4', 'D5', 'D6', 'D7']}, 
                  index = [4, 5, 6, 7])

In [101]:
df3 = pd.DataFrame({'A':['A8', 'A9', 'A10', 'A11'], 
                    'B':['B8', 'B9', 'B10', 'B11'], 
                    'C':['C8', 'C9', 'C10', 'C11'], 
                    'D':['D8', 'D9', 'D10', 'D11']},
                  index = [8, 9, 10, 11])

In [105]:
newDf = pd.concat([df1, df2, df3])
newDf

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [109]:
myDf = pd.concat([df1, df2, df3], axis=1)
myDf

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [111]:
newDf.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [108]:
pd.concat([newDf, pd.DataFrame({'A':['A12'], 'B':['B12'], 'C':['C12'], 'D':['D12']}, 
                               index=[12])])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11
12  A12  B12  C12  D12

In [112]:
df

     Company   Person  Sales
0     GOOGLE      Sam    200
1     GOOGLE  Charlie    120
2  MICROSOFT      Amy    300
3  MICROSOFT     Jack    250
4         FB  Vanessa    340
5         FB     Troy    140

In [114]:
df['Company'].unique()

array(['GOOGLE', 'MICROSOFT', 'FB'], dtype=object)

In [115]:
df['Company'].nunique()

3

In [116]:
df['Person'].unique()

array(['Sam', 'Charlie', 'Amy', 'Jack', 'Vanessa', 'Troy'], dtype=object)

In [117]:
df['Company'].value_counts()

GOOGLE       2
FB           2
MICROSOFT    2
Name: Company, dtype: int64

In [118]:
def times10(x):
    return x * 10

In [119]:
df['Sales'].apply(times10)

0    2000
1    1200
2    3000
3    2500
4    3400
5    1400
Name: Sales, dtype: int64

In [122]:
df['Sales'] = df['Sales'].apply(lambda x : x * 10)

In [123]:
df

     Company   Person  Sales
0     GOOGLE      Sam   2000
1     GOOGLE  Charlie   1200
2  MICROSOFT      Amy   3000
3  MICROSOFT     Jack   2500
4         FB  Vanessa   3400
5         FB     Troy   1400

In [124]:
df['Length'] = df['Person'].apply(len)

In [125]:
df

     Company   Person  Sales  Length
0     GOOGLE      Sam   2000       3
1     GOOGLE  Charlie   1200       7
2  MICROSOFT      Amy   3000       3
3  MICROSOFT     Jack   2500       4
4         FB  Vanessa   3400       7
5         FB     Troy   1400       4